-- 대한항공 샘플데이터 
INSERT AIRLINE (AL_NAME)
VALUE("대한항공");

INSERT AIRPLANE(AP_NUM, AP_AL_NAME, AP_AM_MODEL)
VALUES
	("HL1010","대한항공","A148"),
	("HL2020","대한항공","A158"),
    ("HL3030","대한항공","A320"),
    ("HL4040","대한항공","A333"),
    ("HL5050","대한항공","A388"),
    ("HL6060","대한항공","B737"),
    ("HL7070","대한항공","B738"),
    ("HL8080","대한항공","B763"),
    ("HL9090","대한항공","B78X"),
    ("HL1001","대한항공","T204");
    
INSERT INTO ROUTE(RO_AI_START, RO_AI_END)
VALUES
	("ICN","LHR"), -- 런던
    ("LHR","ICN"),
    ("ICN","HKG"), -- 홍콩
    ("HKG","ICN"),
    ("ICN","SYD"), -- 시드니
    ("SYD","ICN"),
    ("ICN","CDG"), -- 파리
    ("CDG","ICN"),
    ("ICN","MXP"), -- 밀라노
    ("MXP","ICN"),
    ("ICN","SIN"), -- 싱가포르
    ("SIN","ICN"),
    ("ICN","GVA"), -- 스위스
    ("GVA","ICN"),
    ("ICN","CAI"), -- 카이로(이집트)
    ("CAI","ICN"),
    ("ICN","FCO"), -- 로마(이탈리아)
    ("FCO","ICN"),
    ("ICN","HND"), -- 도쿄(일본)
    ("HND","ICN");
    
INSERT SCHEDULE (SK_AP_NUM, SK_RO_NUM, SK_START_TIME, SK_END_TIME, SK_TIME, SK_PRICE)
VALUES
	("HL1001","101",2023-,"00:45","17시간 15분","1,064,500원"),
    ("HL1001","102","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","",""),
    ("HL1001","101","","","","");