/*
-------------------- 메인화면---------------------
사이트이용은 로그인후에 가능하다.
회원가입시 아이디 비번 이름 생년월일 전화번호 이메일을 입력해야한다.

---------------------회원기능---------------------
회원계정으로 로그인 후 사용할 수 있다.

1)항공권 예매
	1-1 왕복, 편도를 선택한다.

	1-2 출발지 도착지를 입력한다
	- 출발할 국가를 입력하여 해당 국가의 공항정보를 출력하여 보여준 후 출발지를 선택하여 입력한다
	- 출발지에서 연결되는 (노선에 등록된) 도착지를 국가별로 구별 후 출력하여 보여준 후 도착지를 선택하여 입력한다
	
	1-3 출발일(왕복일 경우 도착일포함)을 입력받아 스케쥴정보를 출력하여 보여준 후 스케쥴을 선택하여 입력한다
	-출력하여 보여주는 스케쥴 정보는 항공사, 출발지, 도착지, 출발일시, 도착일시, 비행시간, 비용 

		1-3-1 왕복의 경우(A->B, B->A)
		- 출발일과 도착일을 각각 입력한다-> 입력받은 두 날짜중 빠른날을 출발일 늦은날을 도착일로 한다
		- A->B 노선의 출발시간이 출발일인 스케쥴 정보를 출력하여 보여준 후 스케쥴번호를 입력한다(가는 경로)
		- B->A 노선의 출발시간이 도착일인 스케쥴 정보를 출력하여 보여준 후 스케쥴번호를 입력한다(오는 경로)

		1-3-2편도의 경우(A->B)
		- 출발일을 입력한다
		- A->B 노선의 출발시간이 출발일인 스케쥴 정보를 출력하여 보여준 후 스케쥴번호를 입력한다

	1-4 예매좌석수를 입력한다

	1-5 예매좌석수만큼 좌석을 선택하여 입력한다
	- 퍼스트/비지니스/이코노미 중 선택한다
	- 남아있는 좌석의 정보를 출력하여 보여준뒤 입력을 받는다
	- 예매좌석수 만큼 반복한다

	1-6 총비용과 해당 스케쥴을 담당한 항공사에 누적된 마일리지포인트를 보여준 뒤 사용할 마일리지를 입력하고 결제를 완료한다.
	- 총비용은 각 좌석별로 (좌석등급의 배율)*(스케쥴의 기본비용)의 총합이다
	- (결제금액의 0.5%)*(회원등급별 보너스마일리지) 만큼 마일리지를 적립한다.

3)예매 내역 조회
- 예매표발급번호, 출발지, 도착지, 출발일시, 도착일시, 좌석번호, 상태를 출력하여 보여준다
	1)예매취소
	- 상태가 '미확정'인 예매 내역은 취소할 수 있다.
	2)돌아가기

4)마일리지 조회
-이용했던 내역이 있는 항공사별로 마일리지를 출력하여 보여주고 서브메뉴를 입력받는다
	1)상세보기 : 항공사명을 입력받아 해당 항공사의 마일리지 내역 조회
	2)돌아가기

5)회원정보관리
	1)개인정보 수정 : 이름 생년월일 전화번호 이메일 정보를 수정할 수 있다
	2)비밀번호 변경

6)로그아웃

--------------------관리자기능------------------
관리자계정으로 로그인 후 사용할 수 있다.

1)스케쥴을 등록/삭제 할 수 있다.
-스케쥴 등록시 비행기ID 출발지 도착지 출발시간 도착시간 비용을 입력한다

2)노선을 등록/삭제할 수 있다.
-노선 등록 시 출발지와 도착지를 입력한다

3)비행기를 등록/삭제 할 수 있다.
-비행기 등록시 등록번호 항공사명 비행기모델을 입력한다
-없는 항공사일 경우 항공사를 추가한다
-없는 모델일 경우 모델을 추가한다
-모델이 추가된 경우 해당 모델의 좌석을 추가한다

4)공항 정보를 등록/삭제 할 수 있다.
-공항 등록시 공항명, 국가, 표준시를 입력한다

5)회원의 권한을 조정할 수 있다
-ADMIN(관리자), USER(사용자), STOP(이용정지)

6)로그아웃

--------------------- DB ---------------------
회원정보
아이디(PK), 비번, 이름, 영어이름 ,생년월일, 전화번호, 이메일, 권한, 누적마일리지, 회원등급(FK)
-아이디 : 영문으로 시작, 영문, 숫자 조합으로 10~20자
-비번 : 영문, 숫자, !@#$ 조합으로 12~25자
-권한 (USER, ADMIN, STOP)
-회원등급 : 누적마일리지를 기준으로 정해지며 마일리지가 적립될때마다 갱신해준다

회원등급
회원등급(PK), 보너스마일리지
등급		보너스마일리지	누적마일리지
실버 		: 1		:0
골드 		: 1.05		:2만
다이아몬드	: 1.1		:4만
다이아몬드 플러스 	: 1.15		:50만
플래티넘 		: 1.2		:100만

마일리지
마일리지번호(PK), 아이디(FK), 항공사명(FK), 회원등급(FK), 누적마일리지, 보유마일리지

마일리지내역
내역번호(PK), 마일리지번호(FK), 예매번호(FK) 내용
-내용 (적립, 사용)

예매
예매번호(PK), 스케쥴번호(FK), 아이디(FK), 예매좌석수, 총금액, 결제금액, 적립마일리지(결제금액의 0.5%), 사용마일리지, 상태
-총금액 : 각 좌석의 등급별 (배율*기본비용)의 총합
-상태 (확정, 미확정, 예매취소)

예매리스트
예매표일련번호(PK), 예매번호(FK), 좌석번호(FK)
-예매표일련번호 : 예매일자(6), 출발지(3), 도착지(3), 예매순서(4), 좌석번호(4) -빈자리는 0으로 채운다
	ex)2023년 10월 20일 인천국제공항출발(공항코드 ICN) 제주국제공항도착(공항코드 CJU) 8번째 구매자 좌석번호 A8
		=> 231020ICNCJU00800A8


노선
노선번호(PK), 출발지:공항(FK), 도착지:공항(FK)

스케쥴
스케쥴번호(PK), 비행기ID(FK), 노선번호(FK), 출발시간, 도착시간, 비행시간, 기본비용
-출발시간 : datetime(yyyy-MM-dd hh-mm-ss)
-도착시간 : 출발시간+비행시간을 계산한 뒤 도착지의 표준시간으로 표시
-비행시간 : time(hh-mm-ss)

공항
공항번호(PK), 공항명, 국가, 표준시
-공항번호 : IATA 공항코드
(참고 https://namu.wiki/w/IATA/%EA%B3%B5%ED%95%AD%20%EC%BD%94%EB%93%9C)
-표준시 : UTC 기준으로 얼마나 더해야 하는지 입력
ex)인천국제공항 : 한국은 UTC+9 이므로 9를 입력
존 F.케네디 국제공항 : 미국의 뉴욕은 UTC-5 이므로 -5를 입력

비행기
비행기ID(PK), 항공사명(FK), 비행기모델(FK)
-비행기ID : 국가코드(최대3자리)+등록번호(0000~9999)
(참고 https://ko.wikipedia.org/wiki/%ED%95%AD%EA%B3%B5%EA%B8%B0_%EB%93%B1%EB%A1%9D%EA%B8%B0%ED%98%B8)

항공사
항공사명(PK)

모델명
기종코드(PK), 모델명, 퍼스트클래스, 비지니스석, 일반석
-기종코드 : ICAO 항공기코드
(참고 https://namu.wiki/w/%ED%95%AD%EA%B3%B5%EA%B8%B0/%EC%BD%94%EB%93%9C)

좌석
좌석번호(PK), 모델명(FK), 좌석등급(FK)
-좌석번호 : 영문(2)+숫자(2) 

좌석등급
좌석등급(PK), 배율
등급		: 배율
이코노미 클래스	: 1
비지니스 클래스	: 2
퍼스트 클래스	: 4
*/